{
  "vocabulary": [
    {
      "word": "Pérennité",
      "definition": "The quality of being long-lasting or enduring.",
      "french_definition": "La qualité de ce qui dure longtemps, de ce qui est durable.",
      "korean_definition": "오래 지속되거나 지속되는 품질.",
      "example": "La pérennité de l'entreprise dépend de sa capacité à s'adapter aux changements du marché."
    },
    {
      "word": "Sagacité",
      "definition": "The quality of showing keen mental discernment and good judgment.",
      "french_definition": "Qualité de quelqu'un qui fait preuve d'une grande perspicacité et de finesse d'esprit.",
      "korean_definition": "예리한 정신적 통찰력과 좋은 판단력을 보여주는 품질.",
      "example": "Sa sagacité lui a permis de résoudre des problèmes complexes avec aisance."
    },
    {
      "word": "Éphémère",
      "definition": "Lasting for a very short time; fleeting, transient.",
      "french_definition": "Qui dure très peu de temps, qui est passager et de courte durée.",
      "korean_definition": "매우 짧은 시간 동안 지속되는; 덧없는, 일시적인.",
      "example": "La beauté des fleurs de cerisier est éphémère, mais leur floraison est toujours attendue avec impatience."
    },
    {
      "word": "Melliflue",
      "definition": "Pleasingly smooth and gentle to the ear; often used to describe speech or tone that is pleasantly flattering.",
      "french_definition": "Qui est doux et suave au goût ou à l'oreille; souvent utilisé pour décrire un discours ou un ton agréable mais parfois excessivement flatteur.",
      "korean_definition": "귀에 즐겁게 부드럽고 상냥한; 종종 유쾌하게 아첨하는 말이나 어조를 묘사하는 데 사용됩니다.",
      "example": "Il parlait d'une voix melliflue qui pouvait facilement persuader son auditoire."
    },
    {
      "word": "Ineffable",
      "definition": "Too great or extreme to be expressed or described in words; indescribable.",
      "french_definition": "Qui ne peut être exprimé en paroles, indescriptible, souvent en raison de sa grandeur ou de sa beauté.",
      "korean_definition": "말로 표현하거나 묘사하기에는 너무나도 크거나 극단적인; 말로 표현할 수 없는.",
      "example": "L'expérience qu'elle a vécue était si profonde et émouvante qu'elle en était ineffable."
    }
  ]
}
